/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmdiag.h

    Определение кодов диагностических сообщений, объявление функции
    для получения строки с диагностическим сообщением

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef cqmdiagH
#define cqmdiagH

//---------------------------------------------------------------------------
//diagnostics
#define D_IDLE          0x0001
#define D_EMPTY         0x0002
#define D_SOURCE        0x0004
#define D_P_BREAK       0x0008
#define D_A_BREAK       0x0010
#define D_P_MORE        0x0020
#define D_A_MORE        0x0040
#define D_P_LESS        0x0080
#define D_A_LESS        0x0100
#define D_P_N           0x0200
#define D_A_N           0x0400
#define D_P_EXCITED     0x0800
#define D_A_EXCITED     0x1000
#define D_P_SMALLLOAD   0x2000

//---------------------------------------------------------------------------
void diag2str(char* str, int diag);

//---------------------------------------------------------------------------
#endif
