/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmio.h

    Описание класса HardwareIO, который обеспечивает аппаратный ввод/вывод,
    содержит список устройств и сигналов, их соответствие.
    Загрузка информации о устройствах и сигналах из входного потока.
    Стартовые и финальные действия при работе с вводом/выводом.

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef ioH
#define ioH

//---------------------------------------------------------------------------
#include <fstream.h>

//---------------------------------------------------------------------------
#include "cqmsys.h"
#include "ioclass.h"
class Device;
class Signal;

//---------------------------------------------------------------------------
#define MAX_DEVICES 16 //Максимальное количество устройств
#define MAX_SIGNALS 64 //Максимальное количество сигналов

//---------------------------------------------------------------------------
class HardwareIO
{
public:
	HardwareIO(void);
    ~HardwareIO(void);

    char name[MAX_NAME_LEN];

    Device*  devices[MAX_DEVICES];//Массив с указателями на устройства
    int DeviceCount;//Количество устройств

    Signal* signals[MAX_SIGNALS];//Массив с указателями на сигналы
    int SignalCount;//Количество сигналов

    void LoadIO(const char* filename);//load hardware io data from stream
    void ClearIO(void);

    void StartIO(void);//start hardware function before io
    void StopIO (void);//stop  hardware function after io

    void ReadAllSignals(void);//Do In for each signal

    int tick1;//саммый быстрый тик опроса (первый уровень)
    int tick2;//тик второго уровня
    int tick3;//тик третьего уровня

private:
	ifstream f;

	int LoadDevices(void);//load devices
	int LoadSignals(void);//load signals
};

//---------------------------------------------------------------------------
#endif

