/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmpoint003.h

    Описание класса CqmControlPoint003 - потомка CqmControlPoint -
    программная абстракция точки котроля
    на конвейере, которая использует сигналы от конвейера, его питателя,
    от датчика нагрузки и зольности.

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef cqmpoint003H
#define cqmpoint003H

//---------------------------------------------------------------------------
#include "cqmpoint.h"

//---------------------------------------------------------------------------
class CqmControlPoint003 : public CqmControlPoint
{
public:
    CqmControlPoint003(void);
    ~CqmControlPoint003(void);

    void Prepare(void);

    void Start(void);

    istream& Input(istream& s);     //get data from istream
    ostream& Print(ostream& s);     //print to ostream

private:

    char name_f1[MAX_NAME_LEN];//имя питателя

    int n_f1;//номер сигнала питателя

};

//---------------------------------------------------------------------------
extern ostream& operator<< (ostream& s, CqmControlPoint003& p);
extern istream& operator>> (istream& s, CqmControlPoint003& p);

//---------------------------------------------------------------------------
#endif
