/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmstreamparse.h

    Объявление функций для синтаксического анализа входных потоков

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef cqmstreamparseH
#define cqmstreamparseH

//---------------------------------------------------------------------------
#include <istream>

//---------------------------------------------------------------------------
#define COMMENT_SYMBOL    '#'

//---------------------------------------------------------------------------
//функция пропускает в потоке пустые символы и комментарии на '#...'
void SkipSpacesAndComments(std::istream& s);
//возвращает из потока строку между кавычками или скобками
void GetQuote(std::istream& s, char* buf, int bufsize, char forwardQuote, char closeQuote);
//возвращает из потока пару "var = val"
void GetPair(std::istream& s, int bufsize, char* var, char* val, char divider);

//---------------------------------------------------------------------------
#endif
