//---------------------------------------------------------------------------
#ifndef cqmversionH
#define cqmversionH

/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmversion.h

    Определяет версию

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#define CQM_VERSION_MAJOR   3
#define CQM_VERSION_MINOR   0
#define CQM_VERSION_RELEASE 3
#define CQM_VERSION_STATUS  "stable"

//---------------------------------------------------------------------------
#define IC_VERSION_MAJOR   0
#define IC_VERSION_MINOR   2
#define IC_VERSION_RELEASE 0
#define IC_VERSION_STATUS  "alpha"

//---------------------------------------------------------------------------
extern void cqm_version_get_string(char *s);
extern void ic_version_get_string (char *s);

//---------------------------------------------------------------------------
#endif


