/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: cqmvagon.h

    Описание класса CqmVagon, который реализует анализ загрузки угля
    в вагоны с помощью одного питателя

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef cqmvagonsH
#define cqmvagonsH

//---------------------------------------------------------------------------
#include "cqmcustomvagon.h"

//---------------------------------------------------------------------------
class CqmControlPoint;

//---------------------------------------------------------------------------
class CqmVagon : public CqmCustomVagon
{
public:
    CqmVagon(void);
    ~CqmVagon(void);

    void Start(void);
    void Make(void);

    istream& Input(istream& s);     //get data from istream
    ostream& Print(ostream& s);     //print to ostream

protected:
    char pointname[MAX_NAME_LEN];//title name

    int np;//количество интервалов с нормальным весом для всего вагона
    int vnp;//количество интервалов с нормальным весом для вагона в текущей минуте
    double F;//текущая (ежеминутно) сумма частоты нагрузки вагона
    double lnFp;//логарифм средней частоты нагрузки вагона

    virtual void OnPressEov(void);
    virtual void StoreVagon(void);
    virtual int  AddVagon(void);

    CqmControlPoint * P; // Родительская точка контроля
};

//---------------------------------------------------------------------------
extern ostream& operator<< (ostream& s, CqmVagon& p);
extern istream& operator>> (istream& s, CqmVagon& p);

//---------------------------------------------------------------------------
#endif
