/*---------------------------------------------------------------------------
    Copyright (c) 2002-2004 Пиленков  Олег Григорьевич,
                            Невойса   Эрик Григорьевич,
                            Глузман   Владимир Иосифович,
                            Цехмистро Станислав Сергеевич,
                            Кеба      Руслан Анатольевич.

    ЯДРО ПРОГРАММНЫХ СРЕДСТВ
    КОМПЛЕКСА МОНИТОРИНГА КАЧЕСТВА УГЛЕЙ

    Файл: device.h

    Описание класса абстрактного устройства ввода/вывода

---------------------------------------------------------------------------*/

//---------------------------------------------------------------------------
#ifndef deviceH
#define deviceH

//---------------------------------------------------------------------------
#include <iostream.h>

//---------------------------------------------------------------------------
#include "cqmsys.h"

//---------------------------------------------------------------------------
class Device
{
public:
	char model[MAX_NAME_LEN];	//модель устройства
	char name[MAX_NAME_LEN];	//имя устройства
    int ioclass;    //класс устройства
    int base;		//базовый адрес
    int irq;		//irq
    int dma;		//канал dma

	Device(void);	//конструктор
    ~Device(void);  //деструктор

    virtual void Start(void);//инициализация, открытие портов
    virtual void Stop(void);//закрытие портов, завершающие действия

    virtual int Get(int offset, int bit);//получить сигнал
    virtual int Put(int offset, int bit, int data);//вывести сигнал

    virtual istream& Input(istream& s);     //проинициализировать устройство данными из потока
    virtual ostream& Print(ostream& s);     //вывести в поток данные о устройстве
};

extern ostream& operator<< (ostream& s, Device& d);
extern istream& operator>> (istream& s, Device& d);

//---------------------------------------------------------------------------
#endif
